{
	"TabIndex" : 0,
	"ui_inputFile" : "",
	"ui_outputFile" : "",
	"ui_iconFile" : "",
	"ui_title" : "",
	"ui_description" : "",
	"ui_company" : "",
	"ui_product" : "",
	"ui_copyright" : "",
	"ui_trademark" : "",
	"ui_version" : "",
	"ui_runtime" : ["[runtime20] .NET Framework 2.0/3.x for PowerShell 2.0","[runtime40] .NET Framework 4.x for PowerShell 3.0"],
	"ui_instructionSet" : ["x86 - 32-Bit Application","x64 - 64-Bit Application"],
	"ui_threadApartment" : ["STA - Single Thread Apartment","MTA - Multi Thread Apartment"],
	"ui_prepareDebug" : false,
	"ui_noConsole" : false,
	"ui_UNICODEEncoding" : true,
	"ui_credentialGUI" : false,
	"ui_configFile" : false,
	"ui_noOutput" : false,
	"ui_noError" : false,
	"ui_noVisualStyles" : false,
	"ui_exitOnCancel" : false,
	"ui_DPIAware" : false,
	"ui_requireAdmin" : false,
	"ui_supportOS" : true,
	"ui_virtualize" : false,
	"ui_longPaths" : false,
	"ui_extractable" : false,
	"tooltip_inputFile" : "Powershell script to convert to executable (file has to be UTF8 or UTF16 encoded)",
	"tooltip_outputFile" : "destination executable file name or folder, defaults to inputFile with extension '.exe'",
	"tooltip_iconFile" : "icon file name for the compiled executable",
	"tooltip_title" : "title information (displayed in details tab of Windows Explorer's properties dialog)",
	"tooltip_description" : "description information (not displayed, but embedded in executable)",
	"tooltip_company" : "company information (not displayed, but embedded in executable)",
	"tooltip_product" : "product information (displayed in details tab of Windows Explorer's properties dialog)",
	"tooltip_copyright" : "copyright information (displayed in details tab of Windows Explorer's properties dialog)",
	"tooltip_trademark" : "trademark information (displayed in details tab of Windows Explorer's properties dialog)",
	"tooltip_version" : "version information (displayed in details tab of Windows Explorer's properties dialog)",
	"tooltip_runtime" : "this switch forces PS2EXE to create a config file for the generated executable, for the selected setting",
	"tooltip_instructionSet" : "compile for 32-bit or 64-bit runtime",
	"tooltip_threadApartment" : "compile for Single- or Multithreaded Apartment mode",
	"tooltip_prepareDebug" : "create helpful information for debugging of generated executable. See parameter -debug there",
	"tooltip_noConsole" : "the resulting executable will be a Windows Forms app without a console window. You might want to pipe your output to Out-String to prevent a message box for every line of output (example: dir C:\\ | Out-String)",
	"tooltip_UNICODEEncoding" : "encode output as UNICODE in console mode, useful to display special encoded chars",
	"tooltip_credentialGUI" : "use GUI for prompting credentials in console mode instead of console input",
	"tooltip_configFile" : "write a config file (<outputfile>.exe.config)",
	"tooltip_noOutput" : "the resulting executable will generate no standard output (includes verbose and information channel)",
	"tooltip_noError" : "the resulting executable will generate no error output (includes warning and debug channel)",
	"tooltip_noVisualStyles" : "disable visual styles for a generated windows GUI application. Only applicable with parameter -noConsole",
	"tooltip_exitOnCancel" : "exits program when Cancel or 'X' is selected in a Read-Host input box. Only applicable with parameter -noConsole",
	"tooltip_DPIAware" : "if display scaling is activated, GUI controls will be scaled if possible. Only applicable with parameter -noConsole",
	"tooltip_requireAdmin" : "if UAC is enabled, compiled executable will run only in elevated context (UAC dialog appears if required)",
	"tooltip_supportOS" : "use functions of newest Windows versions (execute [Environment]::OSVersion to see the difference)",
	"tooltip_virtualize" : "application virtualization is activated (forcing x86 runtime)",
	"tooltip_longPaths" : "enable long paths ( > 260 characters) if enabled on OS (works only with Windows 10)",
	"tooltip_extractable" : "enables extract-Function (\u003Capplication.exe\u003e -extract:\u003CFILENAME\u003e)"
}